Hi @arnaudlh: I have hit the same issue in my pipeline. Can you please assist with the solution? Its deploying everything except the

 Azure AD Applications | An Azure AD application is created. This account is mainly use to bootstrap the services during the initialization. It is also considered as a breakglass account for the launchpad landing zones   |  


Can anyone Please assist??

Logs
=====


2021-01-20T03:49:53.2966198Z Terraform has been successfully initialized!
2021-01-20T03:49:53.2966574Z 
2021-01-20T03:49:53.2982697Z You may now begin working with Terraform. Try running "terraform plan" to see
2021-01-20T03:49:53.2983384Z any changes that are required for your infrastructure. All Terraform commands
2021-01-20T03:49:53.2983950Z should now work.
2021-01-20T03:49:53.2984237Z 
2021-01-20T03:49:53.2984586Z If you ever set or change modules or backend configuration for Terraform,
2021-01-20T03:49:53.2985049Z rerun this command to reinitialize your working directory. If you forget, other
2021-01-20T03:49:53.2985507Z commands will detect it and remind you to do so if necessary.
2021-01-20T03:49:53.3008074Z Line 176 - Terraform init return code 0
2021-01-20T03:49:53.3012819Z calling plan and apply
2021-01-20T03:49:53.3013238Z @calling plan
2021-01-20T03:49:53.3014118Z running terraform plan with -var-file=/__w/1/s/configuration/demo/level0/launchpad/configuration.tfvars
2021-01-20T03:49:53.3014798Z  -TF_VAR_workspace: level0
2021-01-20T03:49:53.3015455Z  -state: /home/vscode/.terraform.cache/tfstates/level0/launchpad_opensource_light.tfstate
2021-01-20T03:49:53.3016493Z  -plan:  /home/vscode/.terraform.cache/tfstates/level0/launchpad_opensource_light.tfplan
2021-01-20T03:49:53.3016951Z /tf/launchpads/launchpad_opensource_light
2021-01-20T03:49:56.0736556Z Refreshing Terraform state in-memory prior to plan...
2021-01-20T03:49:56.0745034Z The refreshed state will be used to calculate this plan, but will not be
2021-01-20T03:49:56.0745367Z persisted to local or remote state storage.
2021-01-20T03:49:56.0745529Z 
2021-01-20T03:50:01.6172768Z data.azurerm_client_config.current: Refreshing state...
2021-01-20T03:50:01.6173226Z data.azurerm_subscription.primary: Refreshing state...
2021-01-20T03:50:01.8000437Z 
2021-01-20T03:50:01.8002515Z ------------------------------------------------------------------------
2021-01-20T03:50:08.2734587Z 
2021-01-20T03:50:08.2737407Z An execution plan has been generated and is shown below.
2021-01-20T03:50:08.2738087Z Resource actions are indicated with the following symbols:
2021-01-20T03:50:08.2738410Z   + create
2021-01-20T03:50:08.2738568Z 
2021-01-20T03:50:08.2738757Z Terraform will perform the following actions:
2021-01-20T03:50:08.2738932Z 
2021-01-20T03:50:08.2760560Z   # azuread_application.launchpad will be created
2021-01-20T03:50:08.2762318Z   + resource "azuread_application" "launchpad" {
2021-01-20T03:50:08.2762967Z       + application_id  = (known after apply)
2021-01-20T03:50:08.2764296Z       + homepage        = (known after apply)
2021-01-20T03:50:08.2764552Z       + id              = (known after apply)
2021-01-20T03:50:08.2764800Z       + identifier_uris = (known after apply)
2021-01-20T03:50:08.2765068Z       + name            = (known after apply)
2021-01-20T03:50:08.2765314Z       + object_id       = (known after apply)
2021-01-20T03:50:08.2765559Z       + owners          = (known after apply)
2021-01-20T03:50:08.2765819Z       + public_client   = (known after apply)
2021-01-20T03:50:08.2766068Z       + reply_urls      = (known after apply)
2021-01-20T03:50:08.2766319Z       + type            = "webapp/api"
2021-01-20T03:50:08.2766470Z 
2021-01-20T03:50:08.2766643Z       + oauth2_permissions {
2021-01-20T03:50:08.2766887Z           + admin_consent_description  = (known after apply)
2021-01-20T03:50:08.2767397Z           + admin_consent_display_name = (known after apply)
2021-01-20T03:50:08.2767705Z           + id                         = (known after apply)
2021-01-20T03:50:08.2767995Z           + is_enabled                 = (known after apply)
2021-01-20T03:50:08.2768287Z           + type                       = (known after apply)
2021-01-20T03:50:08.2768580Z           + user_consent_description   = (known after apply)
2021-01-20T03:50:08.2768887Z           + user_consent_display_name  = (known after apply)
2021-01-20T03:50:08.2769178Z           + value                      = (known after apply)
2021-01-20T03:50:08.2769391Z         }
2021-01-20T03:50:08.2769514Z 
2021-01-20T03:50:08.2769677Z       + required_resource_access {
2021-01-20T03:50:08.2770586Z           + resource_app_id = "00000002-0000-0000-c000-000000000000"
2021-01-20T03:50:08.2770788Z 
2021-01-20T03:50:08.2770960Z           + resource_access {
2021-01-20T03:50:08.2771406Z               + id   = "824c81eb-e3f8-4ee6-8f6d-de7f50d565b7"
2021-01-20T03:50:08.2771664Z               + type = "Role"
2021-01-20T03:50:08.2771839Z             }
2021-01-20T03:50:08.2772030Z           + resource_access {
2021-01-20T03:50:08.2772462Z               + id   = "5778995a-e1bf-45b8-affa-663a9f3f4d04"
2021-01-20T03:50:08.2772716Z               + type = "Role"
2021-01-20T03:50:08.2772907Z             }
2021-01-20T03:50:08.2773049Z         }
2021-01-20T03:50:08.2773178Z     }
2021-01-20T03:50:08.2773277Z 
2021-01-20T03:50:08.2773471Z   # azuread_service_principal.launchpad will be created
2021-01-20T03:50:08.2773764Z   + resource "azuread_service_principal" "launchpad" {
2021-01-20T03:50:08.2806310Z       + application_id = (known after apply)
2021-01-20T03:50:08.2806633Z       + display_name   = (known after apply)
2021-01-20T03:50:08.2807211Z       + id             = (known after apply)
2021-01-20T03:50:08.2808216Z       + object_id      = (known after apply)
2021-01-20T03:50:08.2808407Z 
2021-01-20T03:50:08.2808562Z       + oauth2_permissions {
2021-01-20T03:50:08.2818201Z           + admin_consent_description  = (known after apply)
2021-01-20T03:50:08.2818532Z           + admin_consent_display_name = (known after apply)
2021-01-20T03:50:08.2818853Z           + id                         = (known after apply)
2021-01-20T03:50:08.2819144Z           + is_enabled                 = (known after apply)
2021-01-20T03:50:08.2819437Z           + type                       = (known after apply)
2021-01-20T03:50:08.2819746Z           + user_consent_description   = (known after apply)
2021-01-20T03:50:08.2820038Z           + user_consent_display_name  = (known after apply)
2021-01-20T03:50:08.2824793Z           + value                      = (known after apply)
2021-01-20T03:50:08.2825098Z         }
2021-01-20T03:50:08.2825249Z     }
2021-01-20T03:50:08.2825352Z 
2021-01-20T03:50:08.2825564Z   # azuread_service_principal_password.launchpad will be created
2021-01-20T03:50:08.2825883Z   + resource "azuread_service_principal_password" "launchpad" {
2021-01-20T03:50:08.2827963Z       + end_date             = (known after apply)
2021-01-20T03:50:08.2828264Z       + end_date_relative    = "43200m"
2021-01-20T03:50:08.2828511Z       + id                   = (known after apply)
2021-01-20T03:50:08.2828794Z       + key_id               = (known after apply)
2021-01-20T03:50:08.2829059Z       + service_principal_id = (known after apply)
2021-01-20T03:50:08.2829325Z       + start_date           = (known after apply)
2021-01-20T03:50:08.2830956Z       + value                = (sensitive value)
2021-01-20T03:50:08.2831169Z     }
2021-01-20T03:50:08.2831275Z 
2021-01-20T03:50:08.2831527Z   # azurecaf_naming_convention.keyvault will be created
2021-01-20T03:50:08.2831826Z   + resource "azurecaf_naming_convention" "keyvault" {
2021-01-20T03:50:08.2832082Z       + convention    = "cafrandom"
2021-01-20T03:50:08.2832313Z       + id            = (known after apply)
2021-01-20T03:50:08.2832541Z       + name          = "level0"
2021-01-20T03:50:08.2832784Z       + prefix        = (known after apply)
2021-01-20T03:50:08.2833188Z       + resource_type = "kv"
2021-01-20T03:50:08.2833408Z       + result        = (known after apply)
2021-01-20T03:50:08.2833606Z     }
2021-01-20T03:50:08.2833708Z 
2021-01-20T03:50:08.2833897Z   # azurecaf_naming_convention.rg will be created
2021-01-20T03:50:08.2834158Z   + resource "azurecaf_naming_convention" "rg" {
2021-01-20T03:50:08.2834411Z       + convention    = "cafrandom"
2021-01-20T03:50:08.2834640Z       + id            = (known after apply)
2021-01-20T03:50:08.2835348Z       + name          = "terraform-state"
2021-01-20T03:50:08.2835608Z       + prefix        = (known after apply)
2021-01-20T03:50:08.2835826Z       + resource_type = "rg"
2021-01-20T03:50:08.2836045Z       + result        = (known after apply)
2021-01-20T03:50:08.2836233Z     }
2021-01-20T03:50:08.2836350Z 
2021-01-20T03:50:08.2836539Z   # azurecaf_naming_convention.stg will be created
2021-01-20T03:50:08.2836800Z   + resource "azurecaf_naming_convention" "stg" {
2021-01-20T03:50:08.2837038Z       + convention    = "cafrandom"
2021-01-20T03:50:08.2837288Z       + id            = (known after apply)
2021-01-20T03:50:08.2837511Z       + name          = "level0"
2021-01-20T03:50:08.2837733Z       + prefix        = (known after apply)
2021-01-20T03:50:08.2852714Z       + resource_type = "st"
2021-01-20T03:50:08.2852966Z       + result        = (known after apply)
2021-01-20T03:50:08.2853151Z     }
2021-01-20T03:50:08.2853255Z 
2021-01-20T03:50:08.2853456Z   # azurerm_key_vault.launchpad will be created
2021-01-20T03:50:08.2853709Z   + resource "azurerm_key_vault" "launchpad" {
2021-01-20T03:50:08.2853962Z       + access_policy       = (known after apply)
2021-01-20T03:50:08.2854218Z       + id                  = (known after apply)
2021-01-20T03:50:08.2854651Z       + location            = "australiaeast"
2021-01-20T03:50:08.2854907Z       + name                = (known after apply)
2021-01-20T03:50:08.2855164Z       + resource_group_name = (known after apply)
2021-01-20T03:50:08.2855426Z       + sku_name            = "standard"
2021-01-20T03:50:08.2855652Z       + tags                = {
2021-01-20T03:50:08.2855860Z           + "tfstate"   = "level0"
2021-01-20T03:50:08.2856072Z           + "workspace" = "level0"
2021-01-20T03:50:08.2856262Z         }
2021-01-20T03:50:08.2856912Z       + tenant_id           = "a1748bd6-83a5-49b7-a575-3bb0a9e155b3"
2021-01-20T03:50:08.2857207Z       + vault_uri           = (known after apply)
2021-01-20T03:50:08.2857392Z 
2021-01-20T03:50:08.2857536Z       + network_acls {
2021-01-20T03:50:08.2857773Z           + bypass                     = (known after apply)
2021-01-20T03:50:08.2858072Z           + default_action             = (known after apply)
2021-01-20T03:50:08.2858380Z           + ip_rules                   = (known after apply)
2021-01-20T03:50:08.2859283Z           + virtual_network_subnet_ids = (known after apply)
2021-01-20T03:50:08.2859499Z         }
2021-01-20T03:50:08.2859645Z     }
2021-01-20T03:50:08.2859746Z 
2021-01-20T03:50:08.2859952Z   # azurerm_key_vault_access_policy.developer will be created
2021-01-20T03:50:08.2860473Z   + resource "azurerm_key_vault_access_policy" "developer" {
2021-01-20T03:50:08.2860748Z       + id                 = (known after apply)
2021-01-20T03:50:08.2861054Z       + key_permissions    = []
2021-01-20T03:50:08.2861286Z       + key_vault_id       = (known after apply)
2021-01-20T03:50:08.2861827Z       + object_id          = "4b818c4e-80a9-43af-b4a0-b45f4f5ba34c"
2021-01-20T03:50:08.2862091Z       + secret_permissions = [
2021-01-20T03:50:08.2862289Z           + "Get",
2021-01-20T03:50:08.2862456Z           + "List",
2021-01-20T03:50:08.2862624Z           + "Set",
2021-01-20T03:50:08.2862808Z           + "Delete",
2021-01-20T03:50:08.2862965Z         ]
2021-01-20T03:50:08.2863391Z       + tenant_id          = "a1748bd6-83a5-49b7-a575-3bb0a9e155b3"
2021-01-20T03:50:08.2863617Z     }
2021-01-20T03:50:08.2863733Z 
2021-01-20T03:50:08.2863941Z   # azurerm_key_vault_access_policy.launchpad will be created
2021-01-20T03:50:08.2864234Z   + resource "azurerm_key_vault_access_policy" "launchpad" {
2021-01-20T03:50:08.2864625Z       + id                 = (known after apply)
2021-01-20T03:50:08.2864868Z       + key_permissions    = []
2021-01-20T03:50:08.2865098Z       + key_vault_id       = (known after apply)
2021-01-20T03:50:08.2865356Z       + object_id          = (known after apply)
2021-01-20T03:50:08.2865600Z       + secret_permissions = [
2021-01-20T03:50:08.2865784Z           + "Get",
2021-01-20T03:50:08.2865949Z           + "List",
2021-01-20T03:50:08.2866114Z           + "Set",
2021-01-20T03:50:08.2866299Z           + "Delete",
2021-01-20T03:50:08.2866454Z         ]
2021-01-20T03:50:08.2866883Z       + tenant_id          = "a1748bd6-83a5-49b7-a575-3bb0a9e155b3"
2021-01-20T03:50:08.2867135Z     }
2021-01-20T03:50:08.2867236Z 
2021-01-20T03:50:08.2867455Z   # azurerm_key_vault_secret.launchpad_application_id will be created
2021-01-20T03:50:08.2867776Z   + resource "azurerm_key_vault_secret" "launchpad_application_id" {
2021-01-20T03:50:08.2868075Z       + id           = (known after apply)
2021-01-20T03:50:08.2868314Z       + key_vault_id = (known after apply)
2021-01-20T03:50:08.2868730Z       + name         = "launchpad-application-id"
2021-01-20T03:50:08.2868980Z       + value        = (sensitive value)
2021-01-20T03:50:08.2885531Z       + version      = (known after apply)
2021-01-20T03:50:08.2886287Z     }
2021-01-20T03:50:08.2886401Z 
2021-01-20T03:50:08.2886647Z   # azurerm_key_vault_secret.launchpad_blob_container will be created
2021-01-20T03:50:08.2912655Z   + resource "azurerm_key_vault_secret" "launchpad_blob_container" {
2021-01-20T03:50:08.2913013Z       + id           = (known after apply)
2021-01-20T03:50:08.2913357Z       + key_vault_id = (known after apply)
2021-01-20T03:50:08.2914192Z       + name         = "launchpad-blob-container"
2021-01-20T03:50:08.2914450Z       + value        = (sensitive value)
2021-01-20T03:50:08.2914689Z       + version      = (known after apply)
2021-01-20T03:50:08.2915352Z     }
2021-01-20T03:50:08.2915472Z 
2021-01-20T03:50:08.2916163Z   # azurerm_key_vault_secret.launchpad_blob_name will be created
2021-01-20T03:50:08.2916563Z   + resource "azurerm_key_vault_secret" "launchpad_blob_name" {
2021-01-20T03:50:08.2916837Z       + id           = (known after apply)
2021-01-20T03:50:08.2917074Z       + key_vault_id = (known after apply)
2021-01-20T03:50:08.2918260Z       + name         = "launchpad-blob-name"
2021-01-20T03:50:08.2918542Z       + value        = (sensitive value)
2021-01-20T03:50:08.2918780Z       + version      = (known after apply)
2021-01-20T03:50:08.2918962Z     }
2021-01-20T03:50:08.2919079Z 
2021-01-20T03:50:08.2919291Z   # azurerm_key_vault_secret.launchpad_client_id will be created
2021-01-20T03:50:08.2921969Z   + resource "azurerm_key_vault_secret" "launchpad_client_id" {
2021-01-20T03:50:08.2922248Z       + id           = (known after apply)
2021-01-20T03:50:08.2922503Z       + key_vault_id = (known after apply)
2021-01-20T03:50:08.2923046Z       + name         = "launchpad-service-principal-client-id"
2021-01-20T03:50:08.2923326Z       + value        = (sensitive value)
2021-01-20T03:50:08.2923578Z       + version      = (known after apply)
2021-01-20T03:50:08.2923759Z     }
2021-01-20T03:50:08.2923860Z 
2021-01-20T03:50:08.2924077Z   # azurerm_key_vault_secret.launchpad_client_secret will be created
2021-01-20T03:50:08.2924856Z   + resource "azurerm_key_vault_secret" "launchpad_client_secret" {
2021-01-20T03:50:08.2925142Z       + id           = (known after apply)
2021-01-20T03:50:08.2925381Z       + key_vault_id = (known after apply)
2021-01-20T03:50:08.2929786Z       + name         = "launchpad-service-principal-client-secret"
2021-01-20T03:50:08.2932127Z       + value        = (sensitive value)
2021-01-20T03:50:08.2933797Z       + version      = (known after apply)
2021-01-20T03:50:08.2935650Z     }
2021-01-20T03:50:08.2938894Z 
2021-01-20T03:50:08.2939954Z   # azurerm_key_vault_secret.launchpad_name will be created
2021-01-20T03:50:08.2944321Z   + resource "azurerm_key_vault_secret" "launchpad_name" {
2021-01-20T03:50:08.2945942Z       + id           = (known after apply)
2021-01-20T03:50:08.2980581Z       + key_vault_id = (known after apply)
2021-01-20T03:50:08.2981361Z       + name         = "launchpad-name"
2021-01-20T03:50:08.2981613Z       + value        = (sensitive value)
2021-01-20T03:50:08.2982379Z       + version      = (known after apply)
2021-01-20T03:50:08.2982682Z     }
2021-01-20T03:50:08.2982796Z 
2021-01-20T03:50:08.2989026Z   # azurerm_key_vault_secret.launchpad_prefix will be created
2021-01-20T03:50:08.2997357Z   + resource "azurerm_key_vault_secret" "launchpad_prefix" {
2021-01-20T03:50:08.2997717Z       + id           = (known after apply)
2021-01-20T03:50:08.2998498Z       + key_vault_id = (known after apply)
2021-01-20T03:50:08.2999277Z       + name         = "launchpad-prefix"
2021-01-20T03:50:08.2999528Z       + value        = (sensitive value)
2021-01-20T03:50:08.2999765Z       + version      = (known after apply)
2021-01-20T03:50:08.2999948Z     }
2021-01-20T03:50:08.3000075Z 
2021-01-20T03:50:08.3000294Z   # azurerm_key_vault_secret.launchpad_resource_group will be created
2021-01-20T03:50:08.3000616Z   + resource "azurerm_key_vault_secret" "launchpad_resource_group" {
2021-01-20T03:50:08.3004238Z       + id           = (known after apply)
2021-01-20T03:50:08.3004521Z       + key_vault_id = (known after apply)
2021-01-20T03:50:08.3005901Z       + name         = "launchpad-resource-group"
2021-01-20T03:50:08.3006166Z       + value        = (sensitive value)
2021-01-20T03:50:08.3006671Z       + version      = (known after apply)
2021-01-20T03:50:08.3006859Z     }
2021-01-20T03:50:08.3006961Z 
2021-01-20T03:50:08.3007328Z   # azurerm_key_vault_secret.launchpad_storage_account_name will be created
2021-01-20T03:50:08.3007986Z   + resource "azurerm_key_vault_secret" "launchpad_storage_account_name" {
2021-01-20T03:50:08.3010027Z       + id           = (known after apply)
2021-01-20T03:50:08.3011616Z       + key_vault_id = (known after apply)
2021-01-20T03:50:08.3012546Z       + name         = "launchpad-storage-account-name"
2021-01-20T03:50:08.3012931Z       + value        = (sensitive value)
2021-01-20T03:50:08.3013426Z       + version      = (known after apply)
2021-01-20T03:50:08.3013836Z     }
2021-01-20T03:50:08.3014074Z 
2021-01-20T03:50:08.3014393Z   # azurerm_key_vault_secret.launchpad_subscription_id will be created
2021-01-20T03:50:08.3014821Z   + resource "azurerm_key_vault_secret" "launchpad_subscription_id" {
2021-01-20T03:50:08.3015190Z       + id           = (known after apply)
2021-01-20T03:50:08.3015518Z       + key_vault_id = (known after apply)
2021-01-20T03:50:08.3016407Z       + name         = "launchpad-subscription-id"
2021-01-20T03:50:08.3016954Z       + value        = (sensitive value)
2021-01-20T03:50:08.3017442Z       + version      = (known after apply)
2021-01-20T03:50:08.3017766Z     }
2021-01-20T03:50:08.3017976Z 
2021-01-20T03:50:08.3018421Z   # azurerm_key_vault_secret.launchpad_tenant_id will be created
2021-01-20T03:50:08.3018894Z   + resource "azurerm_key_vault_secret" "launchpad_tenant_id" {
2021-01-20T03:50:08.3019447Z       + id           = (known after apply)
2021-01-20T03:50:08.3020689Z       + key_vault_id = (known after apply)
2021-01-20T03:50:08.3021556Z       + name         = "launchpad-tenant-id"
2021-01-20T03:50:08.3022012Z       + value        = (sensitive value)
2021-01-20T03:50:08.3022370Z       + version      = (known after apply)
2021-01-20T03:50:08.3022833Z     }
2021-01-20T03:50:08.3023079Z 
2021-01-20T03:50:08.3023494Z   # azurerm_resource_group.rg will be created
2021-01-20T03:50:08.3023899Z   + resource "azurerm_resource_group" "rg" {
2021-01-20T03:50:08.3024273Z       + id       = (known after apply)
2021-01-20T03:50:08.3024618Z       + location = "australiaeast"
2021-01-20T03:50:08.3025068Z       + name     = (known after apply)
2021-01-20T03:50:08.3025435Z       + tags     = {
2021-01-20T03:50:08.3025910Z           + "landingzone"   = "launchpad_opensource_light"
2021-01-20T03:50:08.3026316Z           + "rover_version" = "aztfmod/rover:2007.0108"
2021-01-20T03:50:08.3026949Z           + "workspace"     = "level0"
2021-01-20T03:50:08.3027266Z         }
2021-01-20T03:50:08.3027822Z     }
2021-01-20T03:50:08.3028210Z 
2021-01-20T03:50:08.3029435Z   # azurerm_role_assignment.launchpad_role1 will be created
2021-01-20T03:50:08.3030028Z   + resource "azurerm_role_assignment" "launchpad_role1" {
2021-01-20T03:50:08.3030503Z       + id                               = (known after apply)
2021-01-20T03:50:08.3031060Z       + name                             = (known after apply)
2021-01-20T03:50:08.3031465Z       + principal_id                     = (known after apply)
2021-01-20T03:50:08.3031899Z       + principal_type                   = (known after apply)
2021-01-20T03:50:08.3032468Z       + role_definition_id               = (known after apply)
2021-01-20T03:50:08.3032982Z       + role_definition_name             = "Owner"
2021-01-20T03:50:08.3033847Z       + scope                            = "/subscriptions/e5cfb6f0-14a5-4a8c-aec3-b23375fd4ad2"
2021-01-20T03:50:08.3034490Z       + skip_service_principal_aad_check = (known after apply)
2021-01-20T03:50:08.3034834Z     }
2021-01-20T03:50:08.3035198Z 
2021-01-20T03:50:08.3035550Z   # azurerm_role_assignment.storage_blob_contributor will be created
2021-01-20T03:50:08.3035987Z   + resource "azurerm_role_assignment" "storage_blob_contributor" {
2021-01-20T03:50:08.3036540Z       + id                               = (known after apply)
2021-01-20T03:50:08.3036993Z       + name                             = (known after apply)
2021-01-20T03:50:08.3038035Z       + principal_id                     = "4b818c4e-80a9-43af-b4a0-b45f4f5ba34c"
2021-01-20T03:50:08.3038536Z       + principal_type                   = (known after apply)
2021-01-20T03:50:08.3039248Z       + role_definition_id               = (known after apply)
2021-01-20T03:50:08.3041275Z       + role_definition_name             = "Storage Blob Data Contributor"
2021-01-20T03:50:08.3041605Z       + scope                            = (known after apply)
2021-01-20T03:50:08.3041888Z       + skip_service_principal_aad_check = (known after apply)
2021-01-20T03:50:08.3042209Z     }
2021-01-20T03:50:08.3042326Z 
2021-01-20T03:50:08.3042923Z   # azurerm_role_assignment.storage_blob_contributor_launchpad will be created
2021-01-20T03:50:08.3043246Z   + resource "azurerm_role_assignment" "storage_blob_contributor_launchpad" {
2021-01-20T03:50:08.3043541Z       + id                               = (known after apply)
2021-01-20T03:50:08.3043833Z       + name                             = (known after apply)
2021-01-20T03:50:08.3044107Z       + principal_id                     = (known after apply)
2021-01-20T03:50:08.3044489Z       + principal_type                   = (known after apply)
2021-01-20T03:50:08.3044788Z       + role_definition_id               = (known after apply)
2021-01-20T03:50:08.3045187Z       + role_definition_name             = "Storage Blob Data Contributor"
2021-01-20T03:50:08.3045483Z       + scope                            = (known after apply)
2021-01-20T03:50:08.3045778Z       + skip_service_principal_aad_check = (known after apply)
2021-01-20T03:50:08.3045972Z     }
2021-01-20T03:50:08.3046065Z 
2021-01-20T03:50:08.3046330Z   # azurerm_storage_account.stg will be created
2021-01-20T03:50:08.3046589Z   + resource "azurerm_storage_account" "stg" {
2021-01-20T03:50:08.3046842Z       + access_tier                      = (known after apply)
2021-01-20T03:50:08.3047209Z       + account_kind                     = "BlobStorage"
2021-01-20T03:50:08.3047482Z       + account_replication_type         = "RAGRS"
2021-01-20T03:50:08.3047729Z       + account_tier                     = "Standard"
2021-01-20T03:50:08.3047973Z       + enable_https_traffic_only        = true
2021-01-20T03:50:08.3048233Z       + id                               = (known after apply)
2021-01-20T03:50:08.3048618Z       + is_hns_enabled                   = false
2021-01-20T03:50:08.3048872Z       + location                         = "australiaeast"
2021-01-20T03:50:08.3049372Z       + name                             = (known after apply)
2021-01-20T03:50:08.3049665Z       + primary_access_key               = (sensitive value)
2021-01-20T03:50:08.3050447Z       + primary_blob_connection_string   = (sensitive value)
2021-01-20T03:50:08.3050741Z       + primary_blob_endpoint            = (known after apply)
2021-01-20T03:50:08.3051424Z       + primary_blob_host                = (known after apply)
2021-01-20T03:50:08.3052294Z       + primary_connection_string        = (sensitive value)
2021-01-20T03:50:08.3052737Z       + primary_dfs_endpoint             = (known after apply)
2021-01-20T03:50:08.3053537Z       + primary_dfs_host                 = (known after apply)
2021-01-20T03:50:08.3053833Z       + primary_file_endpoint            = (known after apply)
2021-01-20T03:50:08.3056182Z       + primary_file_host                = (known after apply)
2021-01-20T03:50:08.3065581Z       + primary_location                 = (known after apply)
2021-01-20T03:50:08.3065925Z       + primary_queue_endpoint           = (known after apply)
2021-01-20T03:50:08.3066222Z       + primary_queue_host               = (known after apply)
2021-01-20T03:50:08.3066536Z       + primary_table_endpoint           = (known after apply)
2021-01-20T03:50:08.3066966Z       + primary_table_host               = (known after apply)
2021-01-20T03:50:08.3067255Z       + primary_web_endpoint             = (known after apply)
2021-01-20T03:50:08.3068141Z       + primary_web_host                 = (known after apply)
2021-01-20T03:50:08.3068723Z       + resource_group_name              = (known after apply)
2021-01-20T03:50:08.3069024Z       + secondary_access_key             = (sensitive value)
2021-01-20T03:50:08.3069681Z       + secondary_blob_connection_string = (sensitive value)
2021-01-20T03:50:08.3070574Z       + secondary_blob_endpoint          = (known after apply)
2021-01-20T03:50:08.3071864Z       + secondary_blob_host              = (known after apply)
2021-01-20T03:50:08.3072716Z       + secondary_connection_string      = (sensitive value)
2021-01-20T03:50:08.3073047Z       + secondary_dfs_endpoint           = (known after apply)
2021-01-20T03:50:08.3073347Z       + secondary_dfs_host               = (known after apply)
2021-01-20T03:50:08.3074300Z       + secondary_file_endpoint          = (known after apply)
2021-01-20T03:50:08.3075832Z       + secondary_file_host              = (known after apply)
2021-01-20T03:50:08.3076144Z       + secondary_location               = (known after apply)
2021-01-20T03:50:08.3078901Z       + secondary_queue_endpoint         = (known after apply)
2021-01-20T03:50:08.3080867Z       + secondary_queue_host             = (known after apply)
2021-01-20T03:50:08.3083966Z       + secondary_table_endpoint         = (known after apply)
2021-01-20T03:50:08.3085280Z       + secondary_table_host             = (known after apply)
2021-01-20T03:50:08.3087614Z       + secondary_web_endpoint           = (known after apply)
2021-01-20T03:50:08.3089659Z       + secondary_web_host               = (known after apply)
2021-01-20T03:50:08.3091870Z       + tags                             = (known after apply)
2021-01-20T03:50:08.3092091Z 
2021-01-20T03:50:08.3093636Z       + blob_properties {
2021-01-20T03:50:08.3096154Z           + cors_rule {
2021-01-20T03:50:08.3136778Z               + allowed_headers    = (known after apply)
2021-01-20T03:50:08.3137113Z               + allowed_methods    = (known after apply)
2021-01-20T03:50:08.3137395Z               + allowed_origins    = (known after apply)
2021-01-20T03:50:08.3137692Z               + exposed_headers    = (known after apply)
2021-01-20T03:50:08.3137973Z               + max_age_in_seconds = (known after apply)
2021-01-20T03:50:08.3138362Z             }
2021-01-20T03:50:08.3138489Z 
2021-01-20T03:50:08.3138648Z           + delete_retention_policy {
2021-01-20T03:50:08.3138862Z               + days = (known after apply)
2021-01-20T03:50:08.3139045Z             }
2021-01-20T03:50:08.3139194Z         }
2021-01-20T03:50:08.3139454Z 
2021-01-20T03:50:08.3139589Z       + identity {
2021-01-20T03:50:08.3139797Z           + principal_id = (known after apply)
2021-01-20T03:50:08.3140060Z           + tenant_id    = (known after apply)
2021-01-20T03:50:08.3140306Z           + type         = (known after apply)
2021-01-20T03:50:08.3140495Z         }
2021-01-20T03:50:08.3140601Z 
2021-01-20T03:50:08.3140761Z       + network_rules {
2021-01-20T03:50:08.3140998Z           + bypass                     = (known after apply)
2021-01-20T03:50:08.3141292Z           + default_action             = (known after apply)
2021-01-20T03:50:08.3141597Z           + ip_rules                   = (known after apply)
2021-01-20T03:50:08.3141887Z           + virtual_network_subnet_ids = (known after apply)
2021-01-20T03:50:08.3142103Z         }
2021-01-20T03:50:08.3142208Z 
2021-01-20T03:50:08.3142372Z       + queue_properties {
2021-01-20T03:50:08.3142672Z           + cors_rule {
2021-01-20T03:50:08.3142883Z               + allowed_headers    = (known after apply)
2021-01-20T03:50:08.3143146Z               + allowed_methods    = (known after apply)
2021-01-20T03:50:08.3143421Z               + allowed_origins    = (known after apply)
2021-01-20T03:50:08.3143679Z               + exposed_headers    = (known after apply)
2021-01-20T03:50:08.3143935Z               + max_age_in_seconds = (known after apply)
2021-01-20T03:50:08.3144256Z             }
2021-01-20T03:50:08.3144360Z 
2021-01-20T03:50:08.3144676Z           + hour_metrics {
2021-01-20T03:50:08.3144916Z               + enabled               = (known after apply)
2021-01-20T03:50:08.3145222Z               + include_apis          = (known after apply)
2021-01-20T03:50:08.3145507Z               + retention_policy_days = (known after apply)
2021-01-20T03:50:08.3145868Z               + version               = (known after apply)
2021-01-20T03:50:08.3146099Z             }
2021-01-20T03:50:08.3146210Z 
2021-01-20T03:50:08.3146351Z           + logging {
2021-01-20T03:50:08.3146579Z               + delete                = (known after apply)
2021-01-20T03:50:08.3146887Z               + read                  = (known after apply)
2021-01-20T03:50:08.3147175Z               + retention_policy_days = (known after apply)
2021-01-20T03:50:08.3147467Z               + version               = (known after apply)
2021-01-20T03:50:08.3148422Z               + write                 = (known after apply)
2021-01-20T03:50:08.3149336Z             }
2021-01-20T03:50:08.3149464Z 
2021-01-20T03:50:08.3149620Z           + minute_metrics {
2021-01-20T03:50:08.3149955Z               + enabled               = (known after apply)
2021-01-20T03:50:08.3150406Z               + include_apis          = (known after apply)
2021-01-20T03:50:08.3198364Z               + retention_policy_days = (known after apply)
2021-01-20T03:50:08.3198911Z               + version               = (known after apply)
2021-01-20T03:50:08.3199163Z             }
2021-01-20T03:50:08.3199300Z         }
2021-01-20T03:50:08.3199425Z     }
2021-01-20T03:50:08.3199522Z 
2021-01-20T03:50:08.3199740Z   # azurerm_storage_container.launchpad will be created
2021-01-20T03:50:08.3200018Z   + resource "azurerm_storage_container" "launchpad" {
2021-01-20T03:50:08.3200275Z       + container_access_type   = "private"
2021-01-20T03:50:08.3200545Z       + has_immutability_policy = (known after apply)
2021-01-20T03:50:08.3200818Z       + has_legal_hold          = (known after apply)
2021-01-20T03:50:08.3201091Z       + id                      = (known after apply)
2021-01-20T03:50:08.3201359Z       + metadata                = (known after apply)
2021-01-20T03:50:08.3201629Z       + name                    = "level0"
2021-01-20T03:50:08.3201883Z       + resource_manager_id     = (known after apply)
2021-01-20T03:50:08.3202159Z       + storage_account_name    = (known after apply)
2021-01-20T03:50:08.3202368Z     }
2021-01-20T03:50:08.3202468Z 
2021-01-20T03:50:08.3202648Z   # random_password.launchpad will be created
2021-01-20T03:50:08.3202890Z   + resource "random_password" "launchpad" {
2021-01-20T03:50:08.3203301Z       + id          = (known after apply)
2021-01-20T03:50:08.3203509Z       + length      = 250
2021-01-20T03:50:08.3203696Z       + lower       = true
2021-01-20T03:50:08.3203877Z       + min_lower   = 0
2021-01-20T03:50:08.3204075Z       + min_numeric = 0
2021-01-20T03:50:08.3204252Z       + min_special = 0
2021-01-20T03:50:08.3204428Z       + min_upper   = 0
2021-01-20T03:50:08.3204625Z       + number      = true
2021-01-20T03:50:08.3204831Z       + result      = (sensitive value)
2021-01-20T03:50:08.3205041Z       + special     = false
2021-01-20T03:50:08.3205228Z       + upper       = true
2021-01-20T03:50:08.3205515Z     }
2021-01-20T03:50:08.3205606Z 
2021-01-20T03:50:08.3205763Z   # random_string.alpha1 will be created
2021-01-20T03:50:08.3205980Z   + resource "random_string" "alpha1" {
2021-01-20T03:50:08.3206209Z       + id          = (known after apply)
2021-01-20T03:50:08.3206401Z       + length      = 1
2021-01-20T03:50:08.3206571Z       + lower       = true
2021-01-20T03:50:08.3206758Z       + min_lower   = 0
2021-01-20T03:50:08.3206923Z       + min_numeric = 0
2021-01-20T03:50:08.3207087Z       + min_special = 0
2021-01-20T03:50:08.3207252Z       + min_upper   = 0
2021-01-20T03:50:08.3207438Z       + number      = false
2021-01-20T03:50:08.3207634Z       + result      = (known after apply)
2021-01-20T03:50:08.3207829Z       + special     = false
2021-01-20T03:50:08.3209098Z       + upper       = false
2021-01-20T03:50:08.3209251Z     }
2021-01-20T03:50:08.3209344Z 
2021-01-20T03:50:08.3209518Z   # random_string.prefix will be created
2021-01-20T03:50:08.3209730Z   + resource "random_string" "prefix" {
2021-01-20T03:50:08.3209943Z       + id          = (known after apply)
2021-01-20T03:50:08.3210219Z       + length      = 4
2021-01-20T03:50:08.3210582Z       + lower       = true
2021-01-20T03:50:08.3210764Z       + min_lower   = 0
2021-01-20T03:50:08.3210942Z       + min_numeric = 0
2021-01-20T03:50:08.3211133Z       + min_special = 0
2021-01-20T03:50:08.3211310Z       + min_upper   = 0
2021-01-20T03:50:08.3211498Z       + number      = false
2021-01-20T03:50:08.3211710Z       + result      = (known after apply)
2021-01-20T03:50:08.3211940Z       + special     = false
2021-01-20T03:50:08.3212130Z       + upper       = false
2021-01-20T03:50:08.3212285Z     }
2021-01-20T03:50:08.3212384Z 
2021-01-20T03:50:08.3212632Z   # module.diagnostics.azurecaf_naming_convention.caf_name_evh will be created
2021-01-20T03:50:08.3212949Z   + resource "azurecaf_naming_convention" "caf_name_evh" {
2021-01-20T03:50:08.3213200Z       + convention    = "cafrandom"
2021-01-20T03:50:08.3213446Z       + id            = (known after apply)
2021-01-20T03:50:08.3213667Z       + name          = "diag"
2021-01-20T03:50:08.3213892Z       + prefix        = (known after apply)
2021-01-20T03:50:08.3214111Z       + resource_type = "evh"
2021-01-20T03:50:08.3214342Z       + result        = (known after apply)
2021-01-20T03:50:08.3214523Z     }
2021-01-20T03:50:08.3214622Z 
2021-01-20T03:50:08.3214846Z   # module.diagnostics.azurecaf_naming_convention.caf_name_st will be created
2021-01-20T03:50:08.3215188Z   + resource "azurecaf_naming_convention" "caf_name_st" {
2021-01-20T03:50:08.3215438Z       + convention    = "cafrandom"
2021-01-20T03:50:08.3215665Z       + id            = (known after apply)
2021-01-20T03:50:08.3215899Z       + name          = "diag"
2021-01-20T03:50:08.3216119Z       + prefix        = (known after apply)
2021-01-20T03:50:08.3216367Z       + resource_type = "azurerm_storage_account"
2021-01-20T03:50:08.3216618Z       + result        = (known after apply)
2021-01-20T03:50:08.3216813Z     }
2021-01-20T03:50:08.3216911Z 
2021-01-20T03:50:08.3217120Z   # module.diagnostics.azurerm_storage_account.log will be created
2021-01-20T03:50:08.3217405Z   + resource "azurerm_storage_account" "log" {
2021-01-20T03:50:08.3217671Z       + access_tier                      = "Hot"
2021-01-20T03:50:08.3217936Z       + account_kind                     = "StorageV2"
2021-01-20T03:50:08.3218426Z       + account_replication_type         = "GRS"
2021-01-20T03:50:08.3218770Z       + account_tier                     = "Standard"
2021-01-20T03:50:08.3219032Z       + enable_https_traffic_only        = true
2021-01-20T03:50:08.3219304Z       + id                               = (known after apply)
2021-01-20T03:50:08.3219690Z       + is_hns_enabled                   = false
2021-01-20T03:50:08.3220132Z       + location                         = "australiaeast"
2021-01-20T03:50:08.3220423Z       + name                             = (known after apply)
2021-01-20T03:50:08.3220715Z       + primary_access_key               = (sensitive value)
2021-01-20T03:50:08.3221023Z       + primary_blob_connection_string   = (sensitive value)
2021-01-20T03:50:08.3221321Z       + primary_blob_endpoint            = (known after apply)
2021-01-20T03:50:08.3221617Z       + primary_blob_host                = (known after apply)
2021-01-20T03:50:08.3221930Z       + primary_connection_string        = (sensitive value)
2021-01-20T03:50:08.3222225Z       + primary_dfs_endpoint             = (known after apply)
2021-01-20T03:50:08.3222526Z       + primary_dfs_host                 = (known after apply)
2021-01-20T03:50:08.3222837Z       + primary_file_endpoint            = (known after apply)
2021-01-20T03:50:08.3223131Z       + primary_file_host                = (known after apply)
2021-01-20T03:50:08.3223425Z       + primary_location                 = (known after apply)
2021-01-20T03:50:08.3223737Z       + primary_queue_endpoint           = (known after apply)
2021-01-20T03:50:08.3224034Z       + primary_queue_host               = (known after apply)
2021-01-20T03:50:08.3224329Z       + primary_table_endpoint           = (known after apply)
2021-01-20T03:50:08.3224626Z       + primary_table_host               = (known after apply)
2021-01-20T03:50:08.3224992Z       + primary_web_endpoint             = (known after apply)
2021-01-20T03:50:08.3225292Z       + primary_web_host                 = (known after apply)
2021-01-20T03:50:08.3232086Z       + resource_group_name              = (known after apply)
2021-01-20T03:50:08.3232458Z       + secondary_access_key             = (sensitive value)
2021-01-20T03:50:08.3232753Z       + secondary_blob_connection_string = (sensitive value)
2021-01-20T03:50:08.3233049Z       + secondary_blob_endpoint          = (known after apply)
2021-01-20T03:50:08.3233368Z       + secondary_blob_host              = (known after apply)
2021-01-20T03:50:08.3233665Z       + secondary_connection_string      = (sensitive value)
2021-01-20T03:50:08.3233959Z       + secondary_dfs_endpoint           = (known after apply)
2021-01-20T03:50:08.3234273Z       + secondary_dfs_host               = (known after apply)
2021-01-20T03:50:08.3234570Z       + secondary_file_endpoint          = (known after apply)
2021-01-20T03:50:08.3234872Z       + secondary_file_host              = (known after apply)
2021-01-20T03:50:08.3235169Z       + secondary_location               = (known after apply)
2021-01-20T03:50:08.3235482Z       + secondary_queue_endpoint         = (known after apply)
2021-01-20T03:50:08.3235781Z       + secondary_queue_host             = (known after apply)
2021-01-20T03:50:08.3236075Z       + secondary_table_endpoint         = (known after apply)
2021-01-20T03:50:08.3236386Z       + secondary_table_host             = (known after apply)
2021-01-20T03:50:08.3236683Z       + secondary_web_endpoint           = (known after apply)
2021-01-20T03:50:08.3236984Z       + secondary_web_host               = (known after apply)
2021-01-20T03:50:08.3237272Z       + tags                             = {
2021-01-20T03:50:08.3237538Z           + "landingzone"   = "launchpad_opensource_light"
2021-01-20T03:50:08.3281101Z           + "module"        = "diagnostics"
2021-01-20T03:50:08.3281399Z           + "rover_version" = "aztfmod/rover:2007.0108"
2021-01-20T03:50:08.3281638Z           + "workspace"     = "level0"
2021-01-20T03:50:08.3281810Z         }
2021-01-20T03:50:08.3281929Z 
2021-01-20T03:50:08.3282071Z       + blob_properties {
2021-01-20T03:50:08.3282393Z           + cors_rule {
2021-01-20T03:50:08.3282625Z               + allowed_headers    = (known after apply)
2021-01-20T03:50:08.3282923Z               + allowed_methods    = (known after apply)
2021-01-20T03:50:08.3283205Z               + allowed_origins    = (known after apply)
2021-01-20T03:50:08.3283484Z               + exposed_headers    = (known after apply)
2021-01-20T03:50:08.3283783Z               + max_age_in_seconds = (known after apply)
2021-01-20T03:50:08.3283996Z             }
2021-01-20T03:50:08.3284107Z 
2021-01-20T03:50:08.3284272Z           + delete_retention_policy {
2021-01-20T03:50:08.3284516Z               + days = (known after apply)
2021-01-20T03:50:08.3284709Z             }
2021-01-20T03:50:08.3284856Z         }
2021-01-20T03:50:08.3284962Z 
2021-01-20T03:50:08.3285111Z       + identity {
2021-01-20T03:50:08.3285317Z           + principal_id = (known after apply)
2021-01-20T03:50:08.3285570Z           + tenant_id    = (known after apply)
2021-01-20T03:50:08.3285816Z           + type         = (known after apply)
2021-01-20T03:50:08.3286031Z         }
2021-01-20T03:50:08.3286138Z 
2021-01-20T03:50:08.3286284Z       + network_rules {
2021-01-20T03:50:08.3286522Z           + bypass                     = (known after apply)
2021-01-20T03:50:08.3286834Z           + default_action             = (known after apply)
2021-01-20T03:50:08.3287124Z           + ip_rules                   = (known after apply)
2021-01-20T03:50:08.3287416Z           + virtual_network_subnet_ids = (known after apply)
2021-01-20T03:50:08.3287645Z         }
2021-01-20T03:50:08.3287750Z 
2021-01-20T03:50:08.3287899Z       + queue_properties {
2021-01-20T03:50:08.3288082Z           + cors_rule {
2021-01-20T03:50:08.3288508Z               + allowed_headers    = (known after apply)
2021-01-20T03:50:08.3288865Z               + allowed_methods    = (known after apply)
2021-01-20T03:50:08.3289146Z               + allowed_origins    = (known after apply)
2021-01-20T03:50:08.3289442Z               + exposed_headers    = (known after apply)
2021-01-20T03:50:08.3289724Z               + max_age_in_seconds = (known after apply)
2021-01-20T03:50:08.3289938Z             }
2021-01-20T03:50:08.3290050Z 
2021-01-20T03:50:08.3290215Z           + hour_metrics {
2021-01-20T03:50:08.3290452Z               + enabled               = (known after apply)
2021-01-20T03:50:08.3290741Z               + include_apis          = (known after apply)
2021-01-20T03:50:08.3291028Z               + retention_policy_days = (known after apply)
2021-01-20T03:50:08.3291333Z               + version               = (known after apply)
2021-01-20T03:50:08.3291549Z             }
2021-01-20T03:50:08.3291660Z 
2021-01-20T03:50:08.3291801Z           + logging {
2021-01-20T03:50:08.3292054Z               + delete                = (known after apply)
2021-01-20T03:50:08.3292342Z               + read                  = (known after apply)
2021-01-20T03:50:08.3292629Z               + retention_policy_days = (known after apply)
2021-01-20T03:50:08.3292932Z               + version               = (known after apply)
2021-01-20T03:50:08.3293221Z               + write                 = (known after apply)
2021-01-20T03:50:08.3293438Z             }
2021-01-20T03:50:08.3293548Z 
2021-01-20T03:50:08.3293716Z           + minute_metrics {
2021-01-20T03:50:08.3293959Z               + enabled               = (known after apply)
2021-01-20T03:50:08.3294251Z               + include_apis          = (known after apply)
2021-01-20T03:50:08.3294554Z               + retention_policy_days = (known after apply)
2021-01-20T03:50:08.3294840Z               + version               = (known after apply)
2021-01-20T03:50:08.3295059Z             }
2021-01-20T03:50:08.3295202Z         }
2021-01-20T03:50:08.3295348Z     }
2021-01-20T03:50:08.3295454Z 
2021-01-20T03:50:08.3295687Z   # module.log_analytics.azurecaf_naming_convention.caf_name_la will be created
2021-01-20T03:50:08.3296004Z   + resource "azurecaf_naming_convention" "caf_name_la" {
2021-01-20T03:50:08.3297028Z       + convention    = "cafrandom"
2021-01-20T03:50:08.3297344Z       + id            = (known after apply)
2021-01-20T03:50:08.3299231Z       + name          = "level0"
2021-01-20T03:50:08.3299481Z       + prefix        = (known after apply)
2021-01-20T03:50:08.3299741Z       + resource_type = "azurerm_log_analytics_workspace"
2021-01-20T03:50:08.3300005Z       + result        = (known after apply)
2021-01-20T03:50:08.3300203Z     }
2021-01-20T03:50:08.3300305Z 
2021-01-20T03:50:08.3300546Z   # module.log_analytics.azurerm_log_analytics_solution.la_solution[0] will be created
2021-01-20T03:50:08.3300882Z   + resource "azurerm_log_analytics_solution" "la_solution" {
2021-01-20T03:50:08.3301179Z       + id                    = (known after apply)
2021-01-20T03:50:08.3332206Z       + location              = "australiaeast"
2021-01-20T03:50:08.3332499Z       + resource_group_name   = (known after apply)
2021-01-20T03:50:08.3332787Z       + solution_name         = "KeyVaultAnalytics"
2021-01-20T03:50:08.3333179Z       + workspace_name        = (known after apply)
2021-01-20T03:50:08.3333460Z       + workspace_resource_id = (known after apply)
2021-01-20T03:50:08.3339666Z 
2021-01-20T03:50:08.3339948Z       + plan {
2021-01-20T03:50:08.3340255Z           + name      = (known after apply)
2021-01-20T03:50:08.3340498Z           + product   = "OMSGallery/KeyVaultAnalytics"
2021-01-20T03:50:08.3340745Z           + publisher = "Microsoft"
2021-01-20T03:50:08.3340910Z         }
2021-01-20T03:50:08.3341144Z     }
2021-01-20T03:50:08.3341238Z 
2021-01-20T03:50:08.3341481Z   # module.log_analytics.azurerm_log_analytics_workspace.log_analytics will be created
2021-01-20T03:50:08.3341900Z   + resource "azurerm_log_analytics_workspace" "log_analytics" {
2021-01-20T03:50:08.3342313Z       + id                   = (known after apply)
2021-01-20T03:50:08.3342549Z       + location             = "australiaeast"
2021-01-20T03:50:08.3342805Z       + name                 = (known after apply)
2021-01-20T03:50:08.3343219Z       + portal_url           = (known after apply)
2021-01-20T03:50:08.3343487Z       + primary_shared_key   = (sensitive value)
2021-01-20T03:50:08.3343762Z       + resource_group_name  = (known after apply)
2021-01-20T03:50:08.3344021Z       + retention_in_days    = (known after apply)
2021-01-20T03:50:08.3344279Z       + secondary_shared_key = (sensitive value)
2021-01-20T03:50:08.3344539Z       + sku                  = "PerGB2018"
2021-01-20T03:50:08.3344762Z       + tags                 = {
2021-01-20T03:50:08.3344978Z           + "module" = "log_analytics"
2021-01-20T03:50:08.3345159Z         }
2021-01-20T03:50:08.3345378Z       + workspace_id         = (known after apply)
2021-01-20T03:50:08.3345570Z     }
2021-01-20T03:50:08.3345670Z 
2021-01-20T03:50:08.3345848Z Plan: 35 to add, 0 to change, 0 to destroy.
2021-01-20T03:50:08.3346029Z 
2021-01-20T03:50:08.3346201Z Warning: Value for undeclared variable
2021-01-20T03:50:08.3346356Z 
2021-01-20T03:50:08.3346582Z The root module does not declare a variable named "default_region" but a value
2021-01-20T03:50:08.3346855Z was found in file
2021-01-20T03:50:08.3347106Z "/__w/1/s/configuration/demo/level0/launchpad/configuration.tfvars". To use
2021-01-20T03:50:08.3347417Z this value, add a "variable" block to the configuration.
2021-01-20T03:50:08.3347595Z 
2021-01-20T03:50:08.3347833Z Using a variables file to set an undeclared variable is deprecated and will
2021-01-20T03:50:08.3348175Z become an error in a future release. If you wish to provide certain "global"
2021-01-20T03:50:08.3348502Z settings to all configurations in your organization, use TF_VAR_...
2021-01-20T03:50:08.3348795Z environment variables to set these instead.
2021-01-20T03:50:08.3348953Z 
2021-01-20T03:50:08.3349043Z 
2021-01-20T03:50:08.3349214Z Warning: Value for undeclared variable
2021-01-20T03:50:08.3349375Z 
2021-01-20T03:50:08.3349615Z The root module does not declare a variable named "regions" but a value was
2021-01-20T03:50:08.3349859Z found in file
2021-01-20T03:50:08.3350103Z "/__w/1/s/configuration/demo/level0/launchpad/configuration.tfvars". To use
2021-01-20T03:50:08.3350494Z this value, add a "variable" block to the configuration.
2021-01-20T03:50:08.3350674Z 
2021-01-20T03:50:08.3350897Z Using a variables file to set an undeclared variable is deprecated and will
2021-01-20T03:50:08.3351598Z become an error in a future release. If you wish to provide certain "global"
2021-01-20T03:50:08.3351973Z settings to all configurations in your organization, use TF_VAR_...
2021-01-20T03:50:08.3352347Z environment variables to set these instead.
2021-01-20T03:50:08.3352532Z 
2021-01-20T03:50:08.3352660Z 
2021-01-20T03:50:08.3352858Z Warning: Value for undeclared variable
2021-01-20T03:50:08.3353018Z 
2021-01-20T03:50:08.3353334Z The root module does not declare a variable named "resource_groups" but a
2021-01-20T03:50:08.3353703Z value was found in file
2021-01-20T03:50:08.3353989Z "/__w/1/s/configuration/demo/level0/launchpad/configuration.tfvars". To use
2021-01-20T03:50:08.3354386Z this value, add a "variable" block to the configuration.
2021-01-20T03:50:08.3354674Z 
2021-01-20T03:50:08.3354924Z Using a variables file to set an undeclared variable is deprecated and will
2021-01-20T03:50:08.3369242Z become an error in a future release. If you wish to provide certain "global"
2021-01-20T03:50:08.3369598Z settings to all configurations in your organization, use TF_VAR_...
2021-01-20T03:50:08.3369858Z environment variables to set these instead.
2021-01-20T03:50:08.3370006Z 
2021-01-20T03:50:08.3370092Z 
2021-01-20T03:50:08.3370271Z Warning: Values for undeclared variables
2021-01-20T03:50:08.3370418Z 
2021-01-20T03:50:08.3370628Z In addition to the other similar warnings shown, 4 other variable(s) defined
2021-01-20T03:50:08.3370871Z without being declared.
2021-01-20T03:50:08.3371133Z 
2021-01-20T03:50:08.3371220Z 
2021-01-20T03:50:08.3371806Z ------------------------------------------------------------------------
2021-01-20T03:50:08.3371999Z 
2021-01-20T03:50:08.3372259Z This plan was saved to: /home/vscode/.terraform.cache/tfstates/level0/launchpad_opensource_light.tfplan
2021-01-20T03:50:08.3372532Z 
2021-01-20T03:50:08.3372939Z To perform exactly these actions, run the following command to apply:
2021-01-20T03:50:08.3373338Z     terraform apply "/home/vscode/.terraform.cache/tfstates/level0/launchpad_opensource_light.tfplan"
2021-01-20T03:50:08.3373600Z 
2021-01-20T03:50:08.3392097Z Terraform plan return code: 0
2021-01-20T03:50:08.3393676Z @calling apply
2021-01-20T03:50:08.3393854Z running terraform apply
2021-01-20T03:50:11.0893775Z random_password.launchpad: Creating...
2021-01-20T03:50:11.0905202Z random_string.prefix: Creating...
2021-01-20T03:50:11.0922427Z random_string.alpha1: Creating...
2021-01-20T03:50:11.0938692Z random_password.launchpad: Creation complete after 0s [id=none]
2021-01-20T03:50:11.0961433Z random_string.prefix: Creation complete after 0s [id=fenp]
2021-01-20T03:50:11.0991296Z random_string.alpha1: Creation complete after 0s [id=u]
2021-01-20T03:50:11.1150727Z azuread_application.launchpad: Creating...
2021-01-20T03:50:11.1158213Z module.diagnostics.azurecaf_naming_convention.caf_name_evh: Creating...
2021-01-20T03:50:11.1165065Z azurecaf_naming_convention.keyvault: Creating...
2021-01-20T03:50:11.1174029Z module.log_analytics.azurecaf_naming_convention.caf_name_la: Creating...
2021-01-20T03:50:11.1179328Z azurecaf_naming_convention.rg: Creating...
2021-01-20T03:50:11.1184682Z module.diagnostics.azurecaf_naming_convention.caf_name_st: Creating...
2021-01-20T03:50:11.1201317Z azurecaf_naming_convention.stg: Creating...
2021-01-20T03:50:11.1282497Z module.diagnostics.azurecaf_naming_convention.caf_name_st: Creation complete after 0s [id=iPtEcYTP6sm8EAkc]
2021-01-20T03:50:11.1302842Z module.diagnostics.azurecaf_naming_convention.caf_name_evh: Creation complete after 0s [id=iTCmYUqwOHjxNVTc]
2021-01-20T03:50:11.1342254Z azurecaf_naming_convention.keyvault: Creation complete after 0s [id=eJ8kb10Uty4xjJkU]
2021-01-20T03:50:11.1361467Z module.log_analytics.azurecaf_naming_convention.caf_name_la: Creation complete after 0s [id=jrXn90HgUzO5igCz]
2021-01-20T03:50:11.1380649Z azurecaf_naming_convention.rg: Creation complete after 0s [id=ff0exjbzpaaMmRrE]
2021-01-20T03:50:11.1381103Z azurecaf_naming_convention.stg: Creation complete after 0s [id=sudFW1dPTrY7CQIe]
2021-01-20T03:50:15.9885855Z azurerm_resource_group.rg: Creating...
2021-01-20T03:50:16.6289070Z azurerm_resource_group.rg: Creation complete after 1s [id=/subscriptions/e5cfb6f0-14a5-4a8c-aec3-b23375fd4ad2/resourceGroups/fenp-rg-terraform-state-tqL4lSgMu04XS6m7hyqzVKQhSC3J2ljn9rFmX48M4qFMbBBGmaTVdV5b]
2021-01-20T03:50:16.6398506Z module.log_analytics.azurerm_log_analytics_workspace.log_analytics: Creating...
2021-01-20T03:50:16.6428815Z azurerm_key_vault.launchpad: Creating...
2021-01-20T03:50:16.6454766Z azurerm_storage_account.stg: Creating...
2021-01-20T03:50:16.6544854Z module.diagnostics.azurerm_storage_account.log: Creating...
2021-01-20T03:50:26.6405744Z module.log_analytics.azurerm_log_analytics_workspace.log_analytics: Still creating... [10s elapsed]
2021-01-20T03:50:26.6416333Z azurerm_key_vault.launchpad: Still creating... [10s elapsed]
2021-01-20T03:50:26.6470751Z azurerm_storage_account.stg: Still creating... [10s elapsed]
2021-01-20T03:50:26.6578516Z module.diagnostics.azurerm_storage_account.log: Still creating... [10s elapsed]
2021-01-20T03:50:36.6408195Z module.log_analytics.azurerm_log_analytics_workspace.log_analytics: Still creating... [20s elapsed]
2021-01-20T03:50:36.6418223Z azurerm_key_vault.launchpad: Still creating... [20s elapsed]
2021-01-20T03:50:36.6472719Z azurerm_storage_account.stg: Still creating... [20s elapsed]
2021-01-20T03:50:36.6579202Z module.diagnostics.azurerm_storage_account.log: Still creating... [20s elapsed]
2021-01-20T03:50:38.3523294Z azurerm_storage_account.stg: Creation complete after 21s [id=/subscriptions/e5cfb6f0-14a5-4a8c-aec3-b23375fd4ad2/resourceGroups/fenp-rg-terraform-state-tqL4lSgMu04XS6m7hyqzVKQhSC3J2ljn9rFmX48M4qFMbBBGmaTVdV5b/providers/Microsoft.Storage/storageAccounts/fenpstlevel0htqmam6wmhjy]
2021-01-20T03:50:38.3525147Z azurerm_role_assignment.storage_blob_contributor: Creating...
2021-01-20T03:50:38.3525940Z azurerm_storage_container.launchpad: Creating...
2021-01-20T03:50:38.3526623Z azurerm_storage_container.launchpad: Creation complete after 0s [id=https://fenpstlevel0htqmam6wmhjy.blob.core.windows.net/level0]
2021-01-20T03:50:38.3528480Z module.diagnostics.azurerm_storage_account.log: Creation complete after 21s [id=/subscriptions/e5cfb6f0-14a5-4a8c-aec3-b23375fd4ad2/resourceGroups/fenp-rg-terraform-state-tqL4lSgMu04XS6m7hyqzVKQhSC3J2ljn9rFmX48M4qFMbBBGmaTVdV5b/providers/Microsoft.Storage/storageAccounts/ufenpstdiaglkms1n3vaikku]
2021-01-20T03:50:41.0431627Z azurerm_role_assignment.storage_blob_contributor: Creation complete after 3s [id=/subscriptions/e5cfb6f0-14a5-4a8c-aec3-b23375fd4ad2/resourceGroups/fenp-rg-terraform-state-tqL4lSgMu04XS6m7hyqzVKQhSC3J2ljn9rFmX48M4qFMbBBGmaTVdV5b/providers/Microsoft.Storage/storageAccounts/fenpstlevel0htqmam6wmhjy/providers/Microsoft.Authorization/roleAssignments/5759bf4e-a219-d530-660f-28f333577e8d]
2021-01-20T03:50:46.6409197Z module.log_analytics.azurerm_log_analytics_workspace.log_analytics: Still creating... [30s elapsed]
2021-01-20T03:50:46.6418206Z azurerm_key_vault.launchpad: Still creating... [30s elapsed]
2021-01-20T03:50:56.6410728Z module.log_analytics.azurerm_log_analytics_workspace.log_analytics: Still creating... [40s elapsed]
2021-01-20T03:50:56.6418551Z azurerm_key_vault.launchpad: Still creating... [40s elapsed]
2021-01-20T03:51:06.6416624Z module.log_analytics.azurerm_log_analytics_workspace.log_analytics: Still creating... [50s elapsed]
2021-01-20T03:51:06.6423492Z azurerm_key_vault.launchpad: Still creating... [50s elapsed]
2021-01-20T03:51:16.6417918Z module.log_analytics.azurerm_log_analytics_workspace.log_analytics: Still creating... [1m0s elapsed]
2021-01-20T03:51:16.6425339Z azurerm_key_vault.launchpad: Still creating... [1m0s elapsed]
2021-01-20T03:51:21.2428805Z module.log_analytics.azurerm_log_analytics_workspace.log_analytics: Creation complete after 1m4s [id=/subscriptions/e5cfb6f0-14a5-4a8c-aec3-b23375fd4ad2/resourcegroups/fenp-rg-terraform-state-tql4lsgmu04xs6m7hyqzvkqhsc3j2ljn9rfmx48m4qfmbbbgmatvdv5b/providers/microsoft.operationalinsights/workspaces/ufenp-la-level0-uvpc0y1yjmy2sibwzvw2c5avjnbyfhbopiext9pxns5j50e]
2021-01-20T03:51:21.2503163Z module.log_analytics.azurerm_log_analytics_solution.la_solution[0]: Creating...
2021-01-20T03:51:22.0286350Z module.log_analytics.azurerm_log_analytics_solution.la_solution[0]: Creation complete after 1s [id=/subscriptions/e5cfb6f0-14a5-4a8c-aec3-b23375fd4ad2/resourcegroups/fenp-rg-terraform-state-tqL4lSgMu04XS6m7hyqzVKQhSC3J2ljn9rFmX48M4qFMbBBGmaTVdV5b/providers/Microsoft.OperationsManagement/solutions/KeyVaultAnalytics(ufenp-la-level0-uVPc0Y1yJMY2SIBWzVW2C5aVjNbYfhBopiEXT9PXns5J50e)]
2021-01-20T03:51:26.6427743Z azurerm_key_vault.launchpad: Still creating... [1m10s elapsed]
2021-01-20T03:51:36.6430013Z azurerm_key_vault.launchpad: Still creating... [1m20s elapsed]
2021-01-20T03:51:46.6431798Z azurerm_key_vault.launchpad: Still creating... [1m30s elapsed]
2021-01-20T03:51:56.6435709Z azurerm_key_vault.launchpad: Still creating... [1m40s elapsed]
2021-01-20T03:52:06.6436869Z azurerm_key_vault.launchpad: Still creating... [1m50s elapsed]
2021-01-20T03:52:16.6444774Z azurerm_key_vault.launchpad: Still creating... [2m0s elapsed]
2021-01-20T03:52:22.1837445Z azurerm_key_vault.launchpad: Creation complete after 2m5s [id=/subscriptions/e5cfb6f0-14a5-4a8c-aec3-b23375fd4ad2/resourceGroups/fenp-rg-terraform-state-tqL4lSgMu04XS6m7hyqzVKQhSC3J2ljn9rFmX48M4qFMbBBGmaTVdV5b/providers/Microsoft.KeyVault/vaults/ufenp-kv-level0-gcrbchxf]
2021-01-20T03:52:22.1872172Z azurerm_key_vault_access_policy.developer: Creating...
2021-01-20T03:52:22.8333296Z azurerm_key_vault_access_policy.developer: Creation complete after 1s [id=/subscriptions/e5cfb6f0-14a5-4a8c-aec3-b23375fd4ad2/resourceGroups/fenp-rg-terraform-state-tqL4lSgMu04XS6m7hyqzVKQhSC3J2ljn9rFmX48M4qFMbBBGmaTVdV5b/providers/Microsoft.KeyVault/vaults/ufenp-kv-level0-gcrbchxf/objectId/4b818c4e-80a9-43af-b4a0-b45f4f5ba34c]
2021-01-20T03:52:22.8501608Z Terraform apply return code: 0
2021-01-20T03:52:22.8501896Z Terraform returned errors:
2021-01-20T03:52:22.8515211Z 


ERROR
====================================


2021-01-20T03:52:22.8517299Z Error: graphrbac.ApplicationsClient#Create: Failure responding to request: StatusCode=403 -- Original Error: autorest/azure: Service returned an error. Status=403 Code="Unknown" Message="Unknown service error" Details=[{"odata.error":{"code":"Authorization_RequestDenied","date":"2021-01-20T03:50:11","message":{"lang":"en","value":"Insufficient privileges to complete the operation."},"requestId":"d9ce8e92-845d-4408-831d-5869306a912d"}}]
2021-01-20T03:52:22.8523886Z 
2021-01-20T03:52:22.8524648Z   on identity.tf line 4, in resource "azuread_application" "launchpad":
2021-01-20T03:52:22.8525414Z    4: resource "azuread_application" "launchpad" {
2021-01-20T03:52:22.8525618Z 
2021-01-20T03:52:22.8525712Z 
2021-01-20T03:52:22.8526487Z [41mError on or near line 488: Error running terraform apply; exiting with status 2001[0m
2021-01-20T03:52:22.8526763Z 
2021-01-20T03:52:22.8526921Z @calling clean_up_variables
2021-01-20T03:52:22.8527115Z cleanup variables
2021-01-20T03:52:22.8610939Z ##[error]Bash exited with code '209'.
2021-01-20T03:52:22.8976284Z ##[section]Finishing: Initialize Launchpad for DEV environment

============================================================